# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
#  - [10, 13, 16, 30, 33, 23] # P3/8
#  - [30, 61, 62, 45, 59, 119] # P4/16
#  - [116, 90, 156, 198, 373, 326] # P5/32

  # - [18,18, 24,24, 32,32]
  # - [47,47, 49,49, 53,53]
  # - [67,67, 77,77, 107,107]

  
  - [20,20, 24,24, 29,29]
  - [33,33, 38,39, 42,42]
  - [48,48, 55,55, 60,61]
  - [66,66, 76,77, 91,92]
  - [107,108, 112,112, 120,120]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 3, C3, [64]],
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
#head: [
#    [-1, 1, Conv, [512, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#    [[-1, 6], 1, Concat, [1]], # cat backbone P4
#    [-1, 3, C3, [512, False]], # 13
#
#    [-1, 1, Conv, [256, 1, 1]],
#    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
#    [[-1, 4], 1, Concat, [1]], # cat backbone P3
#    [-1, 3, C3, [256, False]], # 17 (P3/8-small)
#
#    [-1, 1, Conv, [256, 3, 2]],
#    [[-1, 14], 1, Concat, [1]], # cat head P4
#    [-1, 3, C3, [512, False]], # 20 (P4/16-medium)
#
#    [-1, 1, Conv, [512, 3, 2]],
#    [[-1, 10], 1, Concat, [1]], # cat head P5
#    [-1, 3, C3, [1024, False]], # 23 (P5/32-large)
#
#    [[17, 20, 23], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
#  ]

head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 14

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 18

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 3], 1, Concat, [1]], # cat backbone P2
   [-1, 3, C3, [256, False]], # 22 

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 1], 1, Concat, [1]], # cat backbone P1
   [-1, 3, C3, [256, False]], # 26 320*320  P1 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 23], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],  # 29  160*160 P2 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 19], 1, Concat, [1]],
   [-1, 3, C3, [512, False]], # 32 80*80 P3 head

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 15], 1, Concat, [1]],
   [-1, 3, C3, [512, False]], # 35 40*40 P4 head

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 11], 1, Concat, [1]],
   [-1, 3, C3, [1024, False]], # 38 20*20 P5 head

   [[26, 29, 32, 35, 38], 1, Detect, [nc]],  # Detect(P1, P2, P3, P4, P5)
  ]
